import { StyleSheet, Text, View ,Image} from 'react-native';
import React from 'react';
import { heightPercentageToDP, widthPercentageToDP } from 'react-native-responsive-screen';


const Yasin = () => {

    const surahYasin = [
        { ayah: 'يس ۤ ۚ وَالْقُرْآنِ الْحَكِيمِ ۚ إِنَّكَ لَمِنَ الْمُرْسَلِينَ ۚ عَلَىٰ صِرَاطٍ مُسْتَقِيمٍ ۚ تَنزِيلُ الْعَزِيزِ الْحَكِيمِ', number: 1 },
        { ayah: 'لِتُنذِرَ قَوْمًا مَّا أُنذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ ۗ لَقَدْ حَقَّ الْقَوْلُ عَلَىٰ أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ ۚ إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلَالًا فَهِيَ إِلَى ٱلْأَذْقَانِ فَهُمْ مُقْمَحُونَ ۚ وَجَعَلْنَا مِن بَيْنِ أَيْدِيهِمْ سَدًّا وَمِن خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ ۗ وَسَوَاءٌ عَلَيْهِمْ أَذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ', number: 2 },
        // Add remaining Ayat here
      ];
  return (
    <View style={{flex:1}}>
     <View style={{
            alignItems: 'center', justifyContent: 'center',
        }}>
            <Image
                source={require('../Assets/images/Yasin.png')}
                style={{
                width: widthPercentageToDP('100%'),
                height: heightPercentageToDP('80%'),
                }}
                resizeMode="contain"
            />
        </View>

        <View style={{
            borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
            marginBottom: heightPercentageToDP('2%'),
        }}>
            <Text style={styles.arab}>۹</Text>
            <Text style={styles.arab}>سورة يس</Text>
            <Text style={styles.arab}>بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ</Text>
            <Text style={styles.latin}>BISMILLAHIR-ROHMANNIR-ROHIIM</Text>
            <Text style={styles.arab}>خُصُوصًا إِلَى كَنْجُنْ نَبِيِّ مُحَمَّدٍ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ ... اَلْفَاتِحَةُ</Text>
            <Text style={styles.latin}>KHUSUUSON ILAA KANJEUNG NABI MUHAMMAD SHOLLALLOHU ALAIHI WA SALLAM … ALFAATIHAH</Text>
            <Text style={styles.latin}>BACA ALFAATIHAH 1X</Text>
            <Text style={styles.arab}>
            خُصُوصًا إِلَى نَبِيِّ اللَّهِ خِضْرٍ عَلَيْهِ السَّلَامُ
            </Text>
            <Text style={styles.arab}>
            ... الْفَاتِحَةُ
            </Text>
            <Text style={styles.latin}>KHUSUUSON ILAA NABIYYULLOH HIDHIR ALAIHIS-SALAM … ALFAATIHAH</Text>
            <Text style={styles.latin}>BACA ALFAATIHAH 1X</Text>

            </View>

            <View style={{
                        borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
                        marginBottom: heightPercentageToDP('2%'),
                    }}>
            <Text style={styles.arab}>۱۰</Text>
            <Text style={styles.arab}>
            خُصُوصًا إِلَى الْمَلَائِكَةِ الْمُقَرَّبُونَ
            </Text>
            <Text style={styles.arab}>
            ... الْفَاتِحَةُ
            </Text>
            <Text style={styles.latin}>KHUSUUSHON ILAAL MALAA"IKATUL - MUQORROBUUN … ALFAATIHAH...  BACA ALFAATIHAH 1X </Text>

            <Text style={styles.arab}>
            خُصُوصًا إِلَى الشَّيْخِ الْمُرْشِدِ فَهْمِي الْمُحَمَّدِ
            </Text>
            <Text style={styles.latin}>KHUSUUSHON ILAA SYAIKH AL-MURSYD FAHMI AL-MUHAMMAD</Text>

            <Text style={styles.arab}>
            خَيْرُكُ اللهِ... الْفَاتِحَةُ
            </Text>
            <Text style={styles.latin}>KHOIRUQULLOH… ALFAATIHAH</Text>
            <Text style={styles.latin}>BACA ALFAATIHAH 1X</Text>
        </View>

            <View style={{
                        borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
                        marginBottom: heightPercentageToDP('2%'),
                    }}>
                <Text style={styles.arab}>١١</Text>
                <Text style={styles.arab}>بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ</Text>
                <Text style={[styles.arab,{
                     textAlign:'center',
                }]}>
                يٰس ۤ ۚ۞ وَالْقُرْآنِ الْحَكِيمِ ِۙ ۞ إِنَّكَ لَمِنَ الْمُرْسَلِينَ َِۙ ۞ عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ ٍۗ ۞ تَنْزِيلَ الْعَزِيزِ الرَّحِيمِ ِ ۞ لِتُنذِرَ قَوْمًا مَّا أُنذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ ۞ لَقَدْ حَقَّ الْقَوْلُ عَلَىٰ أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ ۞ إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلَالًا فَهِيَ إِلَىٰ ٱلْأَذْقَانِ فَهُمْ مُقْمَحُونَ ۞ وَجَعَلْنَا مِنْ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَرْخْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ ۞ وَسَوَاءٌ عَلَيْهِمْ أَأَنْذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ ۞ إِنَّمَا تُنذِرُ مَنْ اتَّبَعَ الذِّكْرَ وَخَشِيَ الرَّحْمَـٰنَ
                </Text>
            </View>

            <View style={{
                        borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
                        marginBottom: heightPercentageToDP('2%'),
                    }}>
                <Text style={styles.arab}>١٢</Text>

                <Text style={[styles.arab,{
                     textAlign:'center',
                }]}>
                                        بَ ِ لْغَيْب ِۚ فَبَشِّرهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ ۞
                    إِنَّا نَحْنُ نُحْيِي الْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ ۚ وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُّبِينٍ ۞
                    وَاضْرِبْ لَهُم مَّثَلًا أَصْحَابَ الْقَرْيَةِ إِذْ جَاءَهَا ٱلْمُرْسَلُونَ ۞
                    إِذْ أَرْسَلْنَا إِلَيْهِمُ اثْنَيْنِ فَكَذَّبُوهُمَا فَعَزَّزْنَا بِثَالِثٍ فَقَالُوا إِنَّا إِلَيْكُم مُّرْسَلُونَ ۞
                    قَالُوا مَا أَنتُمْ إِلَّا بَشَرٌ مِّثْلُنَا وَمَا أَنزَلَ ٱلرَّحْمَٰنُ مِن شَيْءٍ ۖ إِنْ أَنتُمْ إِلَّا تَكْذِبُونَ ۞
                    قَالُوا رَبُّنَا يَعْلَمُ إِنَّا إِلَيْكُمْ لَمُرْسَلُونَ ۞
                    وَمَا عَلَيْنَا إِلَّا ٱلْبَلَٰغُ ٱلْمُبِينُ ۞
                    قَالُوا إِنَّا تَطَيَّرْنَا بِكُمْ ۖ لَئِن لَّمْ تَنتَهُوا لَنَرْجُمَنَّكُمْ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٌ ۞
                    قَالُوا طَٰٓئِرُكُم مَّعَكُمْ ۗ أَئِن
                </Text>

            </View>

            <View style={{
                        borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
                        marginBottom: heightPercentageToDP('2%'),
                    }}>
                <Text style={styles.arab}>١٣</Text>
                <Text style={[styles.arab,{
                     textAlign:'center',
                }]}>
                    ذُكِّرْتُمۗ بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ ۞
                    وَجَاءَ مِنْ أَقْصَى الْمَدِينَةِ رَجُلٌ يَسْعَىٰ قَالَ يَٰقَوْمِ ٱتَّبِعُوا ٱلْمُرْسَلِينَ ۞
                    ٱتَّبِعُوا مَن لَّا يَسْأَلُكُمْ أَجْرًا وَهُم مُّهْتَدُونَ ۞
                    وَمَا لِيَ لَا أَعْبُدُ ٱلَّذِي فَطَرَنِي وَإِلَيْهِ تُرْجَعُونَ ۞
                    ءَأَتَّخِذُ مِن دُونِهِۦٓ ءَالِهَةً إِن يُرِدْنِ ٱلرَّحْمَٰنُ بِضُرٍّ لَّا تُغْنِ عَنِّي شَفَٰعَتُهُمْ شَيْـًٔا وَلَا يُنقِذُونِ ۞
                    إِنِّيٓ إِذًا لَّفِي ضَلَٰلٍۢ مُّبِينٍ ۞
                    إِنِّيٓ ءَامَنتُ بِرَبِّكُمْ فَٱسْمَعُونِ ۞
                    قِيلَ ٱدْخُلِ ٱلْجَنَّةَ ۖ قَالَ يَٰلَيْتَ قَوْمِي يَعْلَمُونَ ۞
                    بِمَا غَفَرَ لِي رَبِّي وَجَعَلَنِي مِنَ ٱلْمُكْرَمِينَ ۞
                    وَمَآ أَنزَلْنَا عَلَىٰ قَوْمِهِۦ مِنۢ بَعْدِهِۦ مِن جُندٍۢ مِّنَ ٱلسَّمَآءِ وَمَا كُنَّا مُنزِلِينَ ۞
                    إِن كَانَتْ
                </Text>
            </View>

            <View style={{
                        borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
                        marginBottom: heightPercentageToDP('2%'),
                    }}>

            <Text style={styles.arab}>١٤</Text>
                <Text style={[styles.arab,{
                     textAlign:'center',
                }]}>
                                     اِلاَّ صَيْحَةً وَاحِدَةً فَإِذَا هُمۡ خَٰمِدُونَ
                يَٰحَسۡرَةً عَلَى ٱلۡعِبَادِۖ مَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَہۡزِءُونَ ۞
                أَلَمۡ يَرَوۡاْ كَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّنَ ٱلۡقُرُونِ أَنَّهُمۡ إِلَيۡهِمۡ لَا يَرۡجِعُونَ ۞
                وَإِن كُلٌّ۬ لَّمَّا جَمِيعٌ۬ لَّدَيۡنَا مُحۡضَرُونَ ۞
                وَءَايَةٌ۬ لَّهُمُ ٱلۡأَرۡضُ ٱلۡمَيۡتَةُۖ أَحۡيَيۡنَـٰهَا وَأَخۡرَجۡنَا مِنۡهَا حَبًّ۬ا فَمِنۡهُ يَأۡكُلُونَ ۞
                وَجَعَلۡنَا فِيہَا جَنَّـٰتٍ۬ مِّن نَّخِيلٍ۬ وَأَعۡنَـٰبٍ۬ وَفَجَّرۡنَا فِيہَا مِنَ ٱلۡعُيُونِ ۞
                لِيَأۡكُلُواْ مِن ثَمَرِهِۦ وَمَا عَمِلَتۡهُ أَيۡدِيهِمۡۖ أَفَلَا يَشۡكُرُونَ ۞
                سُبۡحَـٰنَ ٱلَّذِى خَلَقَ ٱلۡأَزۡوَٲجَ كُلَّهَا مِمَّا تُنۢبِتُ ٱلۡأَرۡضُ وَمِنۡ أَنفُسِهِمۡ وَمِمَّا لَا يَعۡلَمُونَ ۞
                وَءَايَةٌ۬ لَّهُمُ ٱلَّيۡلُ ۖ نَسۡلَخُ
                </Text>
            </View>

            <View style={{
                        borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
                        marginBottom: heightPercentageToDP('2%'),
                    }}>

            <Text style={styles.arab}>١٥</Text>

            <Text style={styles.arab}>
            مِنْهُ النَّارُ ۚ فَإِذَا هُمْ مُّظْلِمُونَ ۞ وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَهَا ۚ ذَٰلِكَ تَقْدِيرُ ٱلْعَزِيزِ ٱلْعَلِيمِ ۞ وَٱلْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ حَتَّىٰ عَادَ كَٱلْعُرْجُونِ ٱلْقَدِيمِ ۞ لَا ٱلشَّمْسُ يَنْبَغِي لَهَآ أَنْ تُدْرِكَ ٱلْقَمَرَ وَلَا ٱللَّيْلُ سَابِقُ النَّهَارِ ۗ وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ ۞ وَآيَةٌ لَّهُمُ أَنَّا حَمَلْنَا ذُرِّيَّتَهُمْ فِي ٱلْفُلْكِ ٱلْمَشْحُونِ ۞ وَخَلَقْنَا لَهُمْ مِّن مِثْلِهِۦ مَا يَرْكَبُونَ ۞ وَإِن نَّشَأْ نُغْرِقْهُمْ فَلَا صَرِيخَ لَهُمْ وَلَا هُمْ يُنْقَذُونَ ۞ إِلَّا رَحْمَةً مِّنَّا وَمَتَاعًا إِلَىٰ حِينٍ ۞ وَإِذَا قِيلَ لَهُمْ اتَّقُوا مَا بَيْنَ أَيْدِيكُمْ وَمَا خَلْفَكُمْ لَعَلَّكُمْ تُرْحَمُونَ ۞ وَمَا تَأْتِيهِم مِّنْ آيَةٍ  ۞
            </Text>

            </View>


            <View style={{
                        borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
                        marginBottom: heightPercentageToDP('2%'),
                    }}>

            <Text style={styles.arab}>١٦</Text>
            <Text style={styles.arab}>
            مِنْ آيَاتِ رَبِّهِمْ إِلَّا كَانُوا عَنْهَا مُعْرِضِينَ ۞ وَإِذَا قِيلَ لَهُمُ ٱنفِقُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ آمَنُوٓاْ أَنُطْعِمُ مَن لَّوْ يَشَآءُ ٱللَّهُ أَطْعَمَهُۥٓ ۖ إِنْ أَنتُمْ إِلَّا فِى ضَلَـٰلٍۭ مُّبِينٍۢ ۞ وَيَقُولُونَ مَتَىٰ هَـٰذَا ٱلْوَعْدُ إِن كُنتُمْ صَـٰدِقِينَ ۞ مَا يَنظُرُونَ إِلَّا صَيْحَةًۭ وَٰحِدَةًۭ تَأْخُذُهُمْ وَهُمْ يَخِصِّمُونَ ۞ فَلَا يَسْتَطِيعُونَ تَوْصِيَةًۭ وَلَآ إِلَىٰٓ أَهْلِهِمْ يَرْجِعُونَ ۞ وَنُفِخَ فِى ٱلصُّورِ فَإِذَا هُم مِّنَ ٱلْأَجْدَاثِ إِلَىٰ رَبِّهِمْ يَنسِلُونَ ۞ قَالُوا۟ يَـٰوَيْلَنَا مَنۢ بَعَثَنَا مِن مَّرْقَدِنَا ۜ هَـٰذَا مَا وَعَدَ ٱلرَّحْمَـٰنُ وَصَدَقَ ٱلْمُرْسَلُونَ ۞ إِن كَانَتْ إِلَّا صَيْحَةًۭ
            </Text>

            </View>


            <View style={{
                        borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
                        marginBottom: heightPercentageToDP('2%'),
                    }}>

            <Text style={styles.arab}>١٧</Text>
            <Text style={styles.arab}>
            وَاحِدَةًۭ فَإِذَا هُمْ جَمِيعٌۭ لَّدَيْنَا مُحْضَرُونَ ۞ فَٱلْيَوْمَ لَا تُظْلَمُ نَفْسٌۭ شَيْـًۭٔا وَلَا تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ ۞ إِنَّ أَصْحَـٰبَ ٱلْجَنَّةِ ٱلْيَوْمَ فِى شُغُلٍۢ فَـٰكِهُونَ ۞ هُمْ وَأَزْوَٲجُهُمْ فِى ظِلَـٰلٍ عَلَى ٱلْأَرَآئِكِ مُتَّكِـُٔونَ ۞ لَهُمْ فِيهَا فَـٰكِهَةٌۭ وَلَهُم مَّا يَدَّعُونَ ۞ سَلَـٰمٌۭ قَوْلًۭا مِّن رَّبٍّۭ رَّحِيمٍۢ ۞ وَٱمْتَـٰزُوا۟ ٱلْيَوْمَ أَيُّهَا ٱلْمُجْرِمُونَ ۞ أَلَمْ أَعْهَدْ إِلَيْكُمْ يَـٰبَنِىٓ ءَادَمَ أَن لَّا تَعْبُدُوا۟ ٱلشَّيْطَـٰنَ ۖ إِنَّهُۥ لَكُمْ عَدُوٌّۭ مُّبِينٌۭ ۞ وَأَنِ ٱعْبُدُونِى ۖ هَـٰذَا صِرَٰطٌۭ مُّسْتَقِيمٌۭ ۞ وَلَقَدْ أَضَلَّ مِنكُمْ جِبِلًّا كَثِيرًا ۖ أَفَلَمْ تَكُونُوا۟ تَعْقِلُونَ ۞ هَـٰذِهِۦ جَهَنَّمُ ٱلَّتِى كُنتُمْ تُوعَدُونَ ۞ ٱصْلَوْهَا ٱلْيَوْمَ بِمَا كُنتُمْ تَكْفُرُونَ
            </Text>

            </View>

            <View style={{
                        borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
                        marginBottom: heightPercentageToDP('2%'),
                    }}>

                    <Text style={styles.arab}>١٨</Text>
                    <Text style={styles.arab}>
                    ٱلْيَوْمَ نَخْتِمُ عَلَىٰٓ أَفْوَٰهِهِمْ وَتُكَلِّمُنَآ أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُم بِمَا كَانُوا۟ يَكْسِبُونَ ۞ وَلَوْ نَشَآءُ لَطَمَسْنَا عَلَىٰٓ أَعْيُنِهِمْ فَٱسْتَبَقُوا۟ ٱلصِّرَٰطَ فَأَنَّىٰ يُبْصِرُونَ ۞ وَلَوْ نَشَآءُ لَمَسَخْنَٰهُمْ عَلَىٰ مَكَانَتِهِمْ فَمَا ٱسْتَطَٰعُوا۟ مُضِيًّا وَلَا يَرْجِعُونَ ۞ وَمَن نُّعَمِّرْهُ نُنكِّسْهُ فِى ٱلْخَلْقِ ۖ أَفَلَا يَعْقِلُونَ ۞ وَمَا عَلَّمْنَٰهُ ٱلشِّعْرَ وَمَا يَنبَغِى لَهُۥٓ ۚ إِنْ هُوَ إِلَّا ذِكْرٌۭ وَقُرْءَانٌۭ مُّبِينٌۭ ۞ لِيُنذِرَ مَن كَانَ حَيًّا وَيَحِقَّ ٱلْقَوْلُ عَلَى ٱلْكَٰفِرِينَ ۞ أَوَلَمْ يَرَوْا۟ أَنَّا خَلَقْنَا لَهُم مِّمَّا عَمِلَتْ أَيْدِينَآ أَنْعَٰمًۭا فَهُمْ لَهَا مَٰلِكُونَ ۞ وَذَلَّلْنَٰهَا لَهُمْ فَمِنْهَا رَكُوبُهُمْ وَمِنْهَا يَأْكُلُونَ ۞ وَلَهُمْ فِيهَا مَنَٰفِعُ
                    </Text>
            </View>


            <View style={{
                        borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
                        marginBottom: heightPercentageToDP('2%'),
                    }}>

                    <Text style={styles.arab}>١٩</Text>
                    <Text style={styles.arab}>
                    وَمَشَارِبَ ۗ أَفَلَا يَشْكُرُونَ ۞ وَٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ ءَالِهَةًۭ لَّعَلَّهُمْ يُنصَرُونَ ۞ لَا يَسْتَطِيعُونَ نَصْرَهُمْ وَهُمْ لَهُمْ جُندٌۭ مُّحْضَرُونَ ۞ فَلَا يَحْزُنكَ قَوْلُهُمْ ۘ إِنَّا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ ۞ أَوَلَمْ يَرَ ٱلْإِنسَـٰنُ أَنَّا خَلَقْنَـٰهُ مِن نُّطْفَةٍۢ فَإِذَا هُوَ خَصِيمٌۭ مُّبِينٌۭ ۞ وَضَرَبَ لَنَا مَثَلًۭا وَنَسِىَ خَلْقَهُۥ ۖ قَالَ مَن يُحْىِ ٱلْعِظَـٰمَ وَهِىَ رَمِيمٌۭ ۞ قُلْ يُحْيِيهَا ٱلَّذِىٓ أَنشَأَهَآ أَوَّلَ مَرَّةٍۢ ۖ وَهُوَ بِكُلِّ خَلْقٍ عَلِيمٌۭ ۞ ٱلَّذِى جَعَلَ لَكُم مِّنَ ٱلشَّجَرِ ٱلْأَخْضَرِ نَارًۭا فَإِذَآ أَنتُم مِّنْهُ تُوقِدُونَ ۞ أَوَلَيْسَ ٱلَّذِى خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ بِقَـٰدِرٍ عَلَىٰٓ أَن يَخْلُقَ مِثْلَهُم ۚ بَلَّ
                     </Text>
            </View>


            <View style={{
                        borderWidth:2, borderColor: '#000000', padding: 8, backgroundColor: '#FFFFFF',
                        marginBottom: heightPercentageToDP('2%'),
                    }}>

                    <Text style={styles.arab}>٢٠</Text>
                    <Text style={styles.arab}>
                    وَهُوَ ٱلْخَلَّـٰقُ ٱلْعَلِيمُ ۞ إِنَّمَآ أَمْرُهُۥٓ إِذَآ أَرَادَ شَيْـًٔا أَن يَقُولَ لَهُۥ كُن فَيَكُونُ ۞ فَسُبْحَـٰنَ ٱلَّذِى بِيَدِهِۦ مَلَكُوتُ كُلِّ شَىْءٍۢ ۖ وَإِلَيْهِ تُرْجَعُونَ ۞
                    </Text>
                    <Text style={styles.latin}>۞</Text>
                    <Text style={styles.latin}>۞۞</Text>
                    <Text style={styles.latin}>۞۞۞۞</Text>
                    <Text style={styles.latin}>۞۞</Text>
                    <Text style={styles.latin}>۞</Text>
            </View>

    </View>
  );
};

export default Yasin;

const styles = StyleSheet.create({
    arab:{
        color: '#000000',
        fontSize: heightPercentageToDP('4%'),
        fontWeight: 'bold',
        textAlign: 'center',
        marginBottom: heightPercentageToDP('2%'),
        fontFamily: 'UthmanTaha',
    },

    latin:{
        color: '#000000',
        fontSize: heightPercentageToDP('2%'),
        fontWeight: 'bold',
        marginBottom: heightPercentageToDP('4%'),
        alignSelf: 'center',
        fontFamily: 'sans-serif-bold',
        textAlign:'center',
        letterSpacing: 1.5,
    },
});
